uhnp/src/Catalogs/ОбъектыУчетаРезервовПредстоящихРасходов/ОбъектыУчетаРезервовПредстоящихРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбъектыУчетаРезервовПредстоящихРасходов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидРезервов</name>
    <type>
      <types>CatalogRef.Резервы</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <comment>Начало периода создания</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <comment>Конец периода создания</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеНачисления</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельностиНачисления</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходовНачисления</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходовНачисления</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеСписания</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельностиСписания</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДоходовСписания</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаДоходовСписания</name>
    <type>
      <types>Characteristic.СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопускаетсяРазличноеФормированиеРезервовБУиНУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИспользованиеРезерва</name>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛюбаяАналитикаРасходов</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Enums/ТипыРезервовПредстоящихРасходов/ТипыРезервовПредстоящихРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРезервовПредстоящихРасходов</name>
  <enumValues>
    <name>ОплатаТруда</name>
  </enumValues>
  <enumValues>
    <name>ЛиквидационныеОбязательства</name>
  </enumValues>
  <enumValues>
    <name>Прочие</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВариантыРаспределенияРасходов/ВариантыРаспределенияРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыРаспределенияРасходов</name>
  <enumValues>
    <name>НаСебестоимостьТоваров</name>
  </enumValues>
  <enumValues>
    <name>НаСебестоимостьПроизводства</name>
  </enumValues>
  <enumValues>
    <name>НаПроизводственныеЗатраты</name>
  </enumValues>
  <enumValues>
    <name>НаВнеоборотныеАктивы</name>
  </enumValues>
  <enumValues>
    <name>НаСебестоимостьПродаж</name>
  </enumValues>
  <enumValues>
    <name>НаОбъектыВозникновенияЗатрат</name>
  </enumValues>
  <enumValues>
    <name>НаНаправленияДеятельности</name>
  </enumValues>
  <enumValues>
    <name>НаРасходыБудущихПериодов</name>
  </enumValues>
  <enumValues>
    <name>НеРаспределять</name>
  </enumValues>
  <enumValues>
    <name>НаПрочиеАктивы</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/ОбъектыУчетаРезервовПредстоящихРасходов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область СтандартныеПодсистемы

// Включает/отключает использование свойств справочника.
//
Процедура УстановитьИспользованиеСвойств() Экспорт
	
	ПараметрыНабора = УправлениеСвойствами.СтруктураПараметровНабораСвойств();
	ПараметрыНабора.Используется = Константы.ФормироватьРезервыПредстоящихРасходов.Получить();
	
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств(
		"Справочник_ОбъектыУчетаРезервовПредстоящихРасходов", ПараметрыНабора);
	
КонецПроцедуры

// Возвращает имена блокируемых реквизитов для механизма блокирования реквизитов БСП.
//
// Возвращаемое значение:
//	Массив - имена блокируемых реквизитов.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("ВидРезервов");
	Результат.Добавить("НаправлениеДеятельности");
	Результат.Добавить("Организация");
	Результат.Добавить("ИспользованиеРезерва");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЭтоГруппа ИЛИ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

// Возвращает параметры выбора статей в документе.
//
// Параметры:
//  ВидРезерва - СправочникСсылка.Резервы - вид резерва документа.
// 
// Возвращаемое значение:
//  Массив из См. ДоходыИРасходыСервер.ПараметрыВыбораСтатьиИАналитики
//
Функция ПараметрыВыбораСтатейИАналитик(ВидРезерва = Неопределено) Экспорт
	
	МассивПараметровВыбора = Новый Массив;
	
	ТипРезерва = Неопределено;
	Если ВидРезерва <> Неопределено Тогда
		ТипРезерва = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидРезерва, "ТипРезерва");
	КонецЕсли;
	
	#Область СтатьяРасходовНачисления
	ПараметрыВыбора = ДоходыИРасходыСервер.ПараметрыВыбораСтатьиИАналитики();
	ПараметрыВыбора.ПутьКДанным = "Объект";
	ПараметрыВыбора.Статья      = "СтатьяРасходовНачисления";
	
	ПараметрыВыбора.ВыборСтатьиРасходов = Истина;
	ПараметрыВыбора.АналитикаРасходов = "АналитикаРасходовНачисления";
	
	МассивВариантов = Новый Массив;
	Если ТипРезерва = ПредопределенноеЗначение("Перечисление.ТипыРезервовПредстоящихРасходов.ЛиквидационныеОбязательства") Тогда
		МассивВариантов.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы);
		ПараметрыВыбора.ОтборСтатейРасходов.Вставить("РасходыНаОбъектыЭксплуатации", Истина)
	Иначе
		МассивВариантов.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаНаправленияДеятельности);
		МассивВариантов.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства);
		МассивВариантов.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты);
		МассивВариантов.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров);
		МассивВариантов.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат);
		МассивВариантов.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаСебестоимостьПродаж);
		МассивВариантов.Добавить(Перечисления.ВариантыРаспределенияРасходов.НеРаспределять);
		МассивВариантов.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы);
	КонецЕсли;
	ПараметрыВыбора.ОтборСтатейРасходов.ВариантРаспределенияРасходов = МассивВариантов;
	
	ПараметрыВыбора.ЭлементыФормы.Статья.Добавить("СтатьяРасходовНачисления");
	ПараметрыВыбора.ЭлементыФормы.АналитикаРасходов.Добавить("АналитикаРасходовНачисления");
	
	МассивПараметровВыбора.Добавить(ПараметрыВыбора);
	#КонецОбласти
	
	#Область СтатьяДоходовСписания
	ПараметрыВыбора = ДоходыИРасходыСервер.ПараметрыВыбораСтатьиИАналитики();
	ПараметрыВыбора.ПутьКДанным =    "Объект";
	ПараметрыВыбора.Статья = "СтатьяДоходовСписания";
	
	ПараметрыВыбора.ВыборСтатьиДоходов = Истина;
	ПараметрыВыбора.АналитикаДоходов = "АналитикаДоходовСписания";
	
	ПараметрыВыбора.ЭлементыФормы.Статья.Добавить("СтатьяДоходовСписания");
	ПараметрыВыбора.ЭлементыФормы.АналитикаДоходов.Добавить("АналитикаДоходовСписания");
	
	МассивПараметровВыбора.Добавить(ПараметрыВыбора);
	#КонецОбласти
	
	#Область ИспользованиеРезерваСтатьяРасходов
	ПараметрыВыбора = ДоходыИРасходыСервер.ПараметрыВыбораСтатьиИАналитики();
	ПараметрыВыбора.ПутьКДанным =    "Объект.ИспользованиеРезерва";
	ПараметрыВыбора.Статья = "СтатьяРасходов";
	
	ПараметрыВыбора.ВыборСтатьиРасходов = Истина;
	ПараметрыВыбора.АналитикаРасходов = "АналитикаРасходов";
	
	МассивВариантов = Новый Массив;
	МассивВариантов.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаНаправленияДеятельности);
	МассивВариантов.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства);
	МассивВариантов.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты);
	ПараметрыВыбора.ОтборСтатейРасходов.ВариантРаспределенияРасходов = МассивВариантов;
	
	ПараметрыВыбора.ЭлементыФормы.Статья.Добавить("ИспользованиеРезерваСтатьяРасходов");
	ПараметрыВыбора.ЭлементыФормы.АналитикаРасходов.Добавить("ИспользованиеРезерваАналитикаРасходов");
	
	МассивПараметровВыбора.Добавить(ПараметрыВыбора);
	#КонецОбласти
	
	Возврат МассивПараметровВыбора;
	
КонецФункции

#КонецОбласти

#КонецЕсли
